/* original app has been modified and moved */
"%1$@ has been updated and moved. Do you want to change all your keychain items to allow the new version access to your keychain?" = "%1$@ on päivitetty ja siirretty. Haluatko muuttaa kaikkia avainnippusi kohteita, jotta uusi versio voi käyttää avainnippua?";

/* original app has been updated (paths equal) v2 */
"%1$@ has been updated. Do you want to allow the new version to access the same keychain items (such as passwords) as the previous version?" = "%1$@ on päivitetty. Haluatko sallia uuden version käyttää samoja avainnipun kohteita (kuten salasanoja) kuin edellisen version?";

/* original app has been updated (paths equal) */
"%1$@ has been updated. Do you want to change all your keychain items to allow the new version access to your keychain?" = "%1$@ on päivitetty. Haluatko muuttaa kaikkia avainnippusi kohteita, jotta uusi versio voi käyttää avainnippua?";

/* Descriptive text for when the app doesn't match the item's ACL. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain item." = "%1$@ on saatettu päivittää tai muuttaa, kenties ohjelmistopäivityksen aikana. Tämän vuoksi sinun tulee sallia avainnipun kohteen käyttö.";

/* Descriptive text for when the app doesn't match the item acls in a keychain's items. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain." = "%1$@ on ehkä päivitetty tai muutettu, mahdollisesti ohjelmistonpäivityksen yhteydessä. Tämän vuoksi sinun tulee sallia avainnipun käyttö.";

/* Confirm Access message text when operation is unknown. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key affected. */
"%1$@ wants to access key \\U201C%2$@\\U201D in your keychain." = "%1$@ haluaa käyttää avainnipun avainta ”%2$@”.";

/* Confirm Access message text when attempting to generate a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being generated. */
"%1$@ wants to add the  \\U201C%2$@\\U201D item to your keychain." = "%1$@ haluaa lisätä kohteen ”%2$@” avainnippuun.";

/* Confirm Access message text when attempting to modify the ACL of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the ACL is being changed. */
"%1$@ wants to change access permissions of the \\U201C%2$@\\U201D item in your keychain." = "%1$@ haluaa muuttaa avainnipun kohteen ”%2$@” käyttöoikeuksia.";

/* Confirm Access message text when attempting to modify the owner of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the owner is being changed. */
"%1$@ wants to change the owner of the \\U201C%2$@\\U201D item in your keychain (the owner of the item is the one allowed to change access permissions)." = "%1$@ haluaa muuttaa avainnipun kohteen ”%2$@” omistajaa (omistaja on se, jonka sallitaan muuttaa käyttöoikeuksia).";

/* Confirm Access message text when attempting to decrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to decrypt the \\U201C%2$@\\U201D item in your keychain." = "%1$@ haluaa purkaa avainnipun kohteen ”%2$@”.";

/* Confirm Access message text when attempting to delete a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being being deleted. */
"%1$@ wants to delete the \\U201C%2$@\\U201D item from your keychain." = "%1$@ haluaa poistaa kohteen ”%2$@” avainnipusta.";

/* Confirm Access message text when attempting to derive a key from a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used to derive a key from. */
"%1$@ wants to derive a key from key \\U201C%2$@\\U201D in your keychain." = "%1$@ haluaa johtaa avaimen avainnipun avaimesta ”%2$@”.";

/* Confirm Access message text when attempting to encrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to encrypt using key \\U201C%2$@\\U201D in your keychain." = "%1$@ haluaa salata käyttäen avainnipun avainta ”%2$@”.";

/* Confirm Access message text when attempting to export a key in wrapped form. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being exported. */
"%1$@ wants to export key \\U201C%2$@\\U201D from your keychain." = "%1$@ haluaa viedä avainnipusta avaimen ”%2$@”.";

/* Confirm Access message text when attempting to import a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being imported. */
"%1$@ wants to import key \\U201C%2$@\\U201D into your keychain." = "%1$@ haluaa tuoda avaimen ”%2$@” avainnippuun.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign using key \\U201C%2$@\\U201D in your keychain." = "%1$@ haluaa allekirjoittaa käyttäen avainnipun avainta ”%2$@”.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign with key \\U201C%2$@\\U201D in your keychain." = "%1$@ haluaa allekirjoittaa avainnipun avaimella ”%2$@”.";

/* Unlock reason */
"%1$@ wants to use the \\U201C%2$@\\U201D keychain." = "%1$@ haluaa käyttää avainnippua ”%2$@”.";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request. %2$@ says '...allow?' or '...enter keychain password' if password is required for the operation. */
"%1$@ wants to use your .Mac password. %2$@" = "%1$@ haluaa käyttää .Mac-salasanaasi. %2$@";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to use your confidential information stored in \\U201C%2$@\\U201D in your keychain." = "%1$@ haluaa käyttää avainnipun kohteen ”%2$@” sisältämiä luottamuksellisia tietoja.";

/* Part of the Confirm Access message text when application fails static code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been altered on disk. You might be running something that is pretending to be \\U201C%1$@\\U201D." = "Ohjelmaa ”%1$@” on muokattu levyllä. Saatat käyttää ohjelmaa, joka teeskentelee olevansa ”%1$@”.";

/* Part of the Confirm Access message text when application has failed dynamic code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been modified while running and no longer conforms to what was installed on disk." = "Ohjelmaa ”%1$@” on muokattu muistissa eikä se enää vastaa ohjelmaa, joka on levyllä.";

/* Part of the Confirm Access message text when neither a signature nor a path is available to verify the application. */
"\\U201C%1$@\\U201D is unknown. Access is denied." = "”%1$@” on tuntematon. Pääsy kielletty.";

/* new app introduced, give it access? */
"An application named %1$@ needs to access your keychain, but there is an existing version. Do you want to change all your keychain items to allow the new version access to your keychain?" = "Ohjelman nimeltä %1$@ tarvitsee käyttää avainnippuasi, mutta ohjelmasta on jo olemassa versio. Haluatko muuttaa kaikkia avainnippusi kohteita, jotta uusi versio voi käyttää avainnippua?";

/* AppType */
"Application:" = "Ohjelma:";

/* Authentication no longer needed */
"Authentication is no longer needed." = "Todentamista ei enää tarvita.";

/* Cancel button title */
"Cancel" = "Kumoa";

/* changed application wanting access */
"Changed Process:" = "Muuttunut prosessi:";

/* confirm that a application changed panel title string */
"Confirm Application Change" = "Vahvista ohjelman muutos";

/* Copy Location To Clipboard SFURLView menu item */
"Copy Location To Clipboard" = "Kopioi sijainti leikepöydälle";

/* Detail disclosure button label.  Details about authorization requests. */
"Detail" = "Yksityiskohdat";

/* Do you want to allow access to this item? */
"Do you want to allow access to this item?" = "Haluatko sallia tämän kohteen käytön?";

/* Do you want to allow this? */
"Do you want to allow this?" = "Sallitaanko tämä?";

/* Password for a newly created keychain, change keychain password. */
"Enter a new password for the keychain \\U201C%1$@.\\U201D" = "Syötä uusi salasana avainnipulle ”%1$@”.";

/* When configuring a keychain on additional Macs (non-login kc) */
"Enter the password for keychain \\U201C%1$@\\U201D on \\U201C%2$@\\U201D." = "Syötä salasana avainnipulle ”%1$@” kohteessa ”%2$@”.";

/* Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized. */
"Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized." = "Syötä salasana avainnipulle ”%1$@” yhdelle synkronoimistasi tietokoneista.";

/* Part of the Confirm Access message text when application signature cannot be verified.  %1$@ is replaced by the name of the application making the request. */
"It is not possible to tell whether \\U201C%1$@\\U201D is unchanged from the last time it was used. Someone could have modified or replaced it." = "On mahdotonta määrittää, onko ohjelmaa ”%1$@” muutettu sen jälkeen, kun sitä käytettiin viimeksi. Joku on voinut muokata sitä tai korvata sen.";

/* Keychain Access application's name */
"Keychain Access.app" = "Keychain Access.app";

/* When referring to a faceless application or tool that represents the system, Mac OS X, your computer, your system, this replaces the client name in the authentication dialog */
"Mac OS X" = "Mac OS X";

/* Shown instead of Password: when asking the user to provide a new password or change an old one. */
"New Password:" = "Uusi salasana:";

/* No button title */
"No" = "Ei";

/* Sometimes no password is required and the field is inactive.  This string is set in it as a placeholder. */
"Not required." = "Ei vaadita.";

/* OK button title */
"OK" = "OK";

/* Show user provided hint to help remember password */
"Password hint: \\U201C%1$@\\U201D." = "Salasanavihje: ”%1$@”.";

/* In the case of a smartcard instead of a keychain, the PIN label is substituted where the Password label is. */
"PIN:" = "PIN-koodi:";

/* Unlock reason detail */
"Please enter the keychain password." = "Syötä avainnipun salasana.";

/* Typical pwd suggestion */
"Secure passwords typically are longer than 6 characters and should not contain obvious words like dog, cat, and so on." = "Turvalliset salasanat ovat yleensä pidempiä kuin 6 merkkiä, eikä niissä saisi olla yleisiä sanoja kuten koira, kissa tms.";

/* Authentication unable to continue */
"Sorry, unable to continue the authentication." = "Todentamista ei voida valitettavasti jatkaa.";

/* Unlock unable to continue */
"Sorry, unable to continue the unlock." = "Lukituksen poistoa ei voida jatkaa.";

/* Authentication canceled */
"Sorry, you attempted to authenticate too many times." = "Todentamista yritettiin liian monta kertaa.";

/* NewPwd canceled */
"Sorry, you attempted to set your password for the \\U201C%1$@\\U201D keychain too many times." = "Yritit asettaa salasanan avainnipulle ”%1$@” liian monta kertaa.";

/* Unlock canceled */
"Sorry, you attempted to unlock \\U201C%1$@\\U201D too many times." = "Yritit avata kohteen ”%1$@” liian monta kertaa.";

/* Unlock failed; invalid password */
"Sorry, you entered an invalid password." = "Syötit virheellisen salasanan.";

/* For referring to the system keychain. */
"System" = "Järjestelmä";

/* Application with same name is different and possibly in a different location as well. */
"The \\U201C%1$@\\U201D software on your computer has changed and wants to access your keychain." = "Tietokoneen ohjelma ”%1$@” on muuttunut ja haluaa käyttää avainnippua.";

/* Part of the Confirm Access informational text when application is unsigned.  %1$@ is replaced by the name of the application making the request. */
"The authenticity of \\U201C%1$@\\U201D cannot be verified." = "Ohjelman ”%1$@” aitoutta ei voida varmistaa.";

/* error after succefully entering a password which then fails to get added to a keychain. */
"The item could not be added to your default keychain." = "Kohdetta ei voitu lisätä oletus-avainnippuusi.";

/* detailed message for allowing a process to have the same access as original app v2. */
"The keychain items may include passwords and other important information. If you click Allow, the new version of \\U201C%1$@\\U201D will have access to all the keychain items used by previous version. This change is permanent." = "Avainnipun kohteet saattavat sisältää salasanoja ja muuta tärkeää tietoa. Osoittamalla Salli ohjelman ”%1$@” uudella versiolla pääsee avainnipun kaikkiin edellisen version käyttämiin kohteisiin.";

/* Authentication failed; invalid username or password */
"The name or password you entered is incorrect." = "Antamasi käyttäjätunnus tai salasana on virheellinen.";

/* detailed message for allowing a process to have the same access as original app. */
"This change is permanent and affects all keychain items in all your keychains." = "Tämä muutos on pysyvä ja vaikuttaa kaikkiin avainnippusi kohteisiin.";

/* Application with same name is different and possibly in a different location as well. */
"This is a new version of the application \\U201C%1$@\\U201D. Do you want to allow it to access the same keychain items as the previous version?" = "Tämä on ohjelman ”%1$@” uusi versio. Haluatko sallia sen käyttää samoja avainnipun kohteita kuin edellisen version?";

/* When configuring a keychain on additional Macs - details text */
"This is the same password you used to first synchronize your keychain \\U201C%@\\U201D with .Mac." = "Salasana on sama, jolla synkronoit avainnipun ”%@” ensi kertaa .Macin kanssa.";

/* Please enter the keychain password. */
"To allow this, enter the \\U201C%1$@\\U201D keychain password." = "Voit sallia tämän syöttämällä avainnipun ”%1$@” salasanan.";

/* When configuring a keychain on additional Macs (login kc) */
"To synchronize your keychain on this computer, enter the password for your user account on \\U201C%1$@\\U201D." = "Synkronoi tämän tietokoneen avainnippu syöttämällä salasana käyttäjätunnukselle kohteessa ”%1$@”.";

/* To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize. */
"To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize." = "Synkronoi tämän tietokoneen avainnippu syöttämällä käyttäjätunnuksen salasana mille tahansa synkronoitavalle tietokoneelle.";

/* ToolType */
"Tool:" = "Työkalu:";

/* Try again later */
"Try again later." = "Yritä myöhemmin uudelleen.";

/* Please Try again */
"Try entering your information again." = "Syötä tiedot uudelleen.";

/* Authenticate greeting changing the system certificate Trust Settings. */
"Type an administrator's name and password to make changes to the System Certificate Trust Settings." = "Jotta voit tehdä muutoksia järjestelmävarmenteiden luottoasetuksiin, sinun on kirjoitettava ylläpitäjän käyttäjätunnus ja salasana.";

/* Authenticate greeting for a non-admin asking to authenticate as an admin.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type an administrator\\U2019s name and password to allow %1$@ to make changes." = "Jos sallit ohjelman %1$@ tekevän muutoksia, syötä ylläpitäjän käyttäjätunnus ja salasana.";

/* Authenticate greeting for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name, or the localized string representing the system (Mac OS X). */
"Type the name and password of a user in the \\U201C%1$@\\U201D group to allow %2$@ to make changes." = "Jos sallit ohjelman %2$@ tehdä muutoksia, kirjoita ryhmän ”%1$@” käyttäjän käyttäjätunnus ja salasana.";

/* Authenticate greeting for an admin, or a user that can authorize.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type your password to allow %1$@ to make changes." = "Syötä salasana salliaksesi ohjelman %1$@ tekevän muutoksia.";

/* Authenticate greeting changing the per-user certificate Trust Settings. */
"Type your password to make changes to your Certificate Trust Settings." = "Jotta voit tehdä muutoksia varmenteidesi luottoasetuksiin, sinun on kirjoitettava salasanasi.";

/* UnkownProcessType */
"Unknown:" = "Tuntematon:";

/* Unlock no longer needed */
"Unlock is no longer needed." = "Lukituksen poistoa ei enää tarvita.";

/* Yes button title */
"Yes" = "Kyllä";

/* pwd is blank */
"You have not provided a password. Please specify one." = "Et ole antanut salasanaa. Anna se nyt.";

/* pwd too simple */
"You have specified a non-secure password. Please use a longer one." = "Antamasi salasana ei ole turvallinen. Käytä pidempää.";

/* used that pwd before */
"You have used that password before. Please use a different one." = "Olet käyttänyt tätä salasanaa aiemmin. Käytä jotain muuta.";

/* Authentication failure for admin group.  %1$@ gets replaced with Application name. */
"You must type an administrator\\U2019s name and password to make changes to %1$@." = "Kirjoita ylläpitäjän nimi ja salasana, jos haluat tehdä muutoksia kohteeseen %1$@.";

/* Authentication failure for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name. */
"You must type the name and password of a user in the \\U201C%1$@\\U201D group to make changes to %2$@." = "Kirjoita ryhmän ”%1$@” jäsenen nimi ja salasana, jos haluat tehdä muutoksia kohteeseen %2$@.";

/* NewPwd verify not equal */
"Your password is not the same as the verify password." = "Salasanasi poikkeaa varmistussalasanasta.";

/* pwd unacceptable */
"Your password is unacceptable." = "Salasanasi ei kelpaa.";

